; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v7 - type_3 ?v3 - type_1)
 	      (pred_3 ?v2 - object ?v3 - type_1)
	      (pred_2 ?v7 - type_3 ?v4 - type_2)
	      (pred_1 ?v7 - type_3 ?v2 - object ?v4 - type_2))

   (:action op_1
       :parameters  (?v7 - type_3 ?v1 ?v6 - type_1)
       :precondition (and  (pred_4 ?v7 ?v1))
       :effect (and  (pred_4 ?v7 ?v6)
		     (not (pred_4 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_3 ?v8 - object ?v5 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_3 ?v8 ?v5) (pred_4 ?v7 ?v5) (pred_2 ?v7 ?v4))
       :effect (and (pred_1 ?v7 ?v8 ?v4)
		    (not (pred_3 ?v8 ?v5)) 
		    (not (pred_2 ?v7 ?v4))))

   (:action op_3
       :parameters (?v7 - type_3 ?v8 - object ?v5 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v8 ?v4) (pred_4 ?v7 ?v5))
       :effect (and (pred_3 ?v8 ?v5)
		    (pred_2 ?v7 ?v4)
		    (not (pred_1 ?v7 ?v8 ?v4)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_06 obj_08 - type_3
obj_01 obj_11 obj_10 obj_02 - type_2
obj_07 obj_03 obj_09 - type_1
obj_04 obj_05 - object)
(:init
(pred_4 obj_06 obj_07)
(pred_2 obj_06 obj_01)
(pred_2 obj_06 obj_11)
(pred_4 obj_08 obj_03)
(pred_2 obj_08 obj_10)
(pred_2 obj_08 obj_02)
(pred_3 obj_04 obj_03)
(pred_3 obj_05 obj_09)
)
(:goal
(and
(pred_3 obj_04 obj_07)
(pred_3 obj_05 obj_03)
)
)

(:constraints
  (always (not (pred_4 obj_06 obj_09)))
)
)

; plan
1. (op_1 obj_06 obj_07 obj_03)
   deleted: (pred_4 obj_06 obj_07)
   added: (pred_4 obj_06 obj_03)
   goals met: 0 of 2
2. (op_2 obj_08 obj_04 obj_03 obj_02)
   deleted: (pred_3 obj_04 obj_03) (pred_2 obj_08 obj_02)
   added: (pred_1 obj_08 obj_04 obj_02)
   goals met: 0 of 2
3. (op_1 obj_08 obj_03 obj_07)
   deleted: (pred_4 obj_08 obj_03)
   added: (pred_4 obj_08 obj_07)
   goals met: 0 of 2
4. (op_3 obj_08 obj_04 obj_07 obj_02)
   deleted: (pred_1 obj_08 obj_04 obj_02)
   added: (pred_3 obj_04 obj_07) (pred_2 obj_08 obj_02)
   goals met: 1 of 2
5. (op_1 obj_08 obj_07 obj_09)
   deleted: (pred_4 obj_08 obj_07)
   added: (pred_4 obj_08 obj_09)
   goals met: 1 of 2
6. (op_2 obj_08 obj_05 obj_09 obj_02)
   deleted: (pred_3 obj_05 obj_09) (pred_2 obj_08 obj_02)
   added: (pred_1 obj_08 obj_05 obj_02)
   goals met: 1 of 2
7. (op_1 obj_08 obj_09 obj_03)
   deleted: (pred_4 obj_08 obj_09)
   added: (pred_4 obj_08 obj_03)
   goals met: 1 of 2
8. (op_3 obj_08 obj_05 obj_03 obj_02)
   deleted: (pred_1 obj_08 obj_05 obj_02)
   added: (pred_3 obj_05 obj_03) (pred_2 obj_08 obj_02)
   goals met: 2 of 2
